import React from "react";
import { useNavigate } from "react-router-dom";

const Famousdogsinhistory = () => {
  const navigate = useNavigate();
  return (
    <>
      <div className="text-center">
        <img
          style={{ width: "100%" }}
          src="https://img.freepik.com/free-photo/beautiful-pet-portrait-dog_23-2149218450.jpg?t=st=1655154108~exp=1655154708~hmac=0a1115260f600178b415175e6dee33c5c77e8a9be2d2ea29b60041a974f4c939&w=1380"
          alt="תמונה למאמר"
        />
      </div>
      <div className="container d-flex  flex-column justify-content-center">
        <div className="row text-center ">
          <button className="borderStyle col-2" onClick={() => navigate(-1)}>
            אחורה
          </button>
        </div>
        <h2 className="text-center mt-3">
          <b>5 כלבים מפורסמים בהיסטוריה</b>
        </h2>
        <p>
          כלבים רבים התפרסמו במהלך ההיסטוריה בגלל יכולות יוצאות דופן, מעשי
          גבורה, מסירות ללא קץ לבעלים ונאמנות רבה. בכתבה שהכנו עבורכם נעסוק
          בכלבים אמיתיים ומפורסמים, אבל אנו חייבים להזכיר גם את לאסי – כלבת
          הקולי האמיצה שהתפרסמה בספרו הנודע של אריק נייט. בסרט הקולנוע הידוע
          בהשתתפות השחקנית אליזבת טיילור, דווקא קולי ממין זכר גילם את דמותה של
          לאסי.
        </p>
        <h4>
          <b> לייקה – כלבת הרחוב שטסה לחלל</b>
        </h4>
        <img
          src="https://scontent.fsdv1-2.fna.fbcdn.net/v/t31.18172-8/14882142_743601489113894_8298561177879987829_o.jpg?_nc_cat=105&ccb=1-7&_nc_sid=9267fe&_nc_ohc=AmYdvW_9gyAAX8PskQU&_nc_ht=scontent.fsdv1-2.fna&oh=00_AT_V2021tdE_ym8FP88sHlwpc37AugjYMZzCz3umgkwYnw&oe=62CE498B"
          alt="לייקה הכלבה"
          style={{ width: "340px", height: "100%" }}
        />
        <br />
        <p>
          לייקה היא ללא ספק כלבה מפורסמת בהיסטוריה ובעלת סיפור יוצא דופן.
          <br /> לייקה היא כלבת החלל הראשונה שהקיפה את כדור הארץ בתכנית החלל
          הסובייטית. כדאי לדעת כי לייקה נלקחה מהרחוב יחד עם שני כלבים אחרים, היא
          עברה אימונים מפרכים ונבחרה לעלות על החללית ספוטניק 2 ששוגרה לחלל ב-3
          בנובמבר 1957.
          <br />
          לייקה שוכנה על ידי הסובייטים בתא מיוחד עם אוויר דחוס, אך בגלל תקלה
          במערכת בקרת הטמפרטורה היא הצליחה לשרוד רק מספר שעות, למרות שהתכנון
          המקורי היה 10 ימים.
          <br />
          בשנת 2008 בנו הרוסים אנדרטה בסמוך למתקן המחקר הצבאי שבו היא התאמנה -
          כמחווה להישגיה בחלל של לייקה.
        </p>
        <h4>
          <b>באלטו – האסקי סיבירי שהציל את תושבי העיירה נום באלסקה</b>
        </h4>
        <img
          src="https://img.mako.co.il/2019/12/12/akdogdriver_i.jpg"
          alt="באלטו האסקי סיביר"
          style={{ width: "340px", height: "100%" }}
        />
        <br />
        <p>
          סיפורו של באלטו, כלב מסג האסקי סיבירי, מוכיח את הקשר האמיץ בין האדם
          לכלב.
          <br />
          בינואר 1925 הכתה מחלת הדיפתריה את תושבי העיירה נום שבאלסקה ורבים
          מתושביה מתו, בהם עשרות ילדים ומבוגרים. הרופאים בעיירה לא החזיקו בתרופה
          נגד דיפתריה והם חיפשו דרך להביא את התרופה מהעיר אנקורג' שנמצאת במרחק
          כ-1,600 ק"מ מהעיירה.
        </p>

        <p>
          צוותי מזחלות כלבים נרתמו למשימה הכמעט בלתי אפשרית בגלל תנאי האקלים
          הקשים, הרוח העזה והטמפרטורות שצנחו מתחת לאפס והגיע למינוס 30 מעלות.
          <br />
          במהלך המסע המפרך הועברה התרופה לרוכב המזחלות הנורווגי קאסן, הוא יצא
          לדרך למרות התנאים הקשים ואזהרות חבריו, ואת מזחלת הכלבים של קאסן הוביל
          הכלב באלטו. הכלב יוצא הדופן והגיבור הציל את חיי קאסן ושאר הכלבים כאשר
          מנע מהמזחלת לחצות את נהר טופקוק בגלל הסכנה. הוא מצא נתיב אחר, אך קאסן
          איבד את הדרך ובאלטו סייע לו לנווט ולחצות את הדרך.
        </p>

        <p>
          בסוף הנתיב קאסן המתין לנהג מזחלות אחר, אך כאשר הרוכב המחליף לא הגיע,
          קאסן ובאלטו המשיכו את במסע לעיירה נום.
          <br />
          הכלב זכה להוקרה גם מנשיא ארצות הברית, וניתן לבקר בפסל שהוקם לכבודו
          וניצב בסנטרל פארק שבניו יורק.
        </p>

        <h4>בו – הכלב המפורסם של משפחת אובמה</h4>
        <img
          src="https://ynet-images1.yit.co.il/picserver5/crop_images/2021/05/09/SyGggxfBdd/SyGggxfBdd_0_0_3000_2000_0_x-large.jpg"
          alt="בו הכלב המשפחתי של משפחת אובמה"
          style={{ width: "340px", height: "100%" }}
        />
        <br />
        <p>
          נשיא ארה"ב לשעבר ברק אובמה ציין בנאומו לאומה בשנת 2009 כי הבטיח
          לבנותיו גור כלבים.
          <br />
          בנאום יוצא הדופן שלו הוא ציין עד כמה הוא אוהב את בנותיו סשה ומליה
          והבטיח להן לאמץ בקרוב כלב מגזע היפו-אלרגני בגלל האלרגיה של בתו מליה.
        </p>
        <p>
          בו הוא כלב מיוחד מגזע הנקרא כלב מים פורטוגלי, במקור הוא מגיע מאזור
          אלגברה שבפורטוגל.
          <br />
          בו ניתן במתנה למשפחת אובמה על ידי הסנאטור טד קנדי הנמנה על אחד מתשעת
          החברים בארגון "כלבי המים הפורטוגליים" הממוקם בבוייד, טקסס.
        </p>
        <h4>
          <u>
            <b>בארי – הסן ברנרד המפורסם בעולם</b>
          </u>
        </h4>
        <img
          src="https://eurekacdn-stips.netdna-ssl.com/images/w400/3102804530.jpg"
          alt="בארי הסן ברנרד"
          style={{ width: "340px", height: "100%" }}
        />
        <br />
        <p>
          גזע הסן ברנרד פותח על מנת להציל חיי אדם, בעיקר בהרים. זהו כלב ידידותי
          ונאמן הידוע בגודלו המרשים.
          <br />
          הסן ברנרד המפורסם ביותר בעולם הוא ללא ספק הכלב בארי.
          <br />
          בארי חי בין השנים 1800 עד 1810 ובמהלך חייו הציל לפחות 40 איש ממוות
          בטוח. בארי חי ופעל בהרי שוויץ עמוסי השלג והקרחונים ופעל עבור אכסניית
          סן ברנאר הגדול הממוקמת במעבר ההרים קנטון.
        </p>
        <h4>רולף – הכלב המתקשר</h4>
        <img
          src="https://www.animalshop.co.il/images/itempics/uploads/media_06042020172502.jpg?rnd=.5758173?rnd=0.26550803230904085"
          alt="רולף הכלב המדבר"
          style={{ width: "340px", height: "100%" }}
        />
        <br />
        <p>
          רולף הוא כלב מגזע איירדייל טרייר, הוא אחד הכלבים המפורסמים ביותר בעולם
          בגלל יכולת התקשור שלו עם בני אדם, הוא גם היה ידוע בכישוריו המתמטיים
          ובאינטליגנציה הגבוהה שלו. רולף תקשר עם בני אדם באמצעות הטלפיים שלו,
          הוא טפח בטלפיו והטפיחות השונות ייצגו אותיות בשפה הגרמנית.
        </p>
      </div>
    </>
  );
};

export default Famousdogsinhistory;
