import React from "react";
import { useNavigate } from "react-router-dom";

const OutSideTheHome = () => {
  const navigate = useNavigate();
  return (
    <>
      <div>
        <img
          style={{ width: "100%" }}
          src="https://images.unsplash.com/photo-1505121000079-2b276cdbf4fb?ixlib=rb-1.2.1&ixid=MnwxMjA3fDB8MHxwaG90by1wYWdlfHx8fGVufDB8fHx8&auto=format&fit=crop&w=2056&q=80"
          alt="תמונה למאמר"
        />
      </div>
      <div className="container d-flex  flex-column justify-content-center">
        <div className="row text-center ">
          <button className="borderStyle col-2" onClick={() => navigate(-1)}>
            אחורה
          </button>
        </div>
        <h2 className="text-center mt-3">
          <b>איך מאלפים כלב לעשות צרכים מחוץ לבית?</b>
        </h2>
        <p>
          חינוך הכלב לעשיית צרכיו בחוץ חשוב מאוד עבורכם אך גם עבור חיית המחמד
          שאימצתם. לאחר שמאמצים גור כלבים חביב ופרוותי חשוב לחנך ולאלף אותו
          לעשות את צרכיו בחוץ, ולמעשה עליו ללמוד כיצד לשלוט בצרכיו. מומלץ לאלף
          את הכלב לעשות צרכים בחוץ בעודו גור, ויש מספר שיטות וטכניקות באמצעותן
          תוכלו לאלף את בן המשפחה החדש שלכם.
        </p>
        <h4>
          <b> מומלץ לאלף את הגור מגיל 3 חודשים</b>
        </h4>
        <p>
          מאלפי כלבים מנוסים ומקצועיים לרוב ימליצו לכם לשלוח את הכלב לאילוף
          לעשיית צרכים בחוץ רק כאשר הכלב מגיע לגיל 3 חודשים.
          <br /> עד גיל 3 חודשים גור הכלבים אינו מחוסן עדיין בפני טפילים
          וזיהומים שונים, והוא צעיר מידי כדי להבין פקודות וליישם אותן.
          <br />
          חשוב לציין כי אפשר לאלף את הכלב לעשות צרכים בחוץ גם לבד, אך עליכם
          לזכור כי מדובר במשימה סיזיפית יחסית, יש לתרגל עם הכלב שלבים שונים עד
          שהוא מסוגל לשלוט בצרכיו ולהתאפק עד הטיול בחוץ, ועליכם להתמודד עם
          הפתעות שונות שהגור החמוד משאיר בבית בכל מיני מקומות.
          <br />
          <br />
          <u>
            {" "}
            <b>
              {" "}
              כדאי לדעת כי ישנם זמנים קריטיים בהם הכלב חייב לעשות את צרכיו והוא
              עלול להתקשות להתאפק:
            </b>
          </u>
          <ul>
            <li>
              כלבים, כמו בני אדם, חייבים לעשות צרכים מוקדם בבוקר, מיד לאחר שהם
              מתעוררים משנת הלילה.
            </li>
            <li>בדרך כלל הכלב צריך לעשות צרכים זמן קצר לאחר הארוחה.</li>
            <li>
              רוב הכלבים מתרגשים בעת משחק, לכן חשוב להוציא אותם לאחר משחק או
              פעילות אחרת המרגשת אותם.
            </li>
            <li>
              אם אתם קושרים את הכלב בחצר או מגבילים את תנועתו בדירה, חשוב להוציא
              אותו החוצה לעשות צרכים לפני קשירתו.
            </li>
          </ul>
        </p>
        <h4>
          <b>אילוף הכלב לעשיית צרכים בחוץ מבוסס על מספר שלבים:</b>
        </h4>
        <p>
          <ul>
            <li>
              בשלב הראשון עליכם להקפיד לקחת את הכלב החוצה כעשר דקות לאחר שהוא
              אוכל. אם הכלב עושה את צרכיו בחוץ חשוב לעודד אותו, ללטף אותו ואפשר
              לתת לו גם חטיף.
            </li>
            <li>
              בשלב הבא כדאי לקשר בין מילה מסוימת לפעולת עשיית הצרכים, למשל
              "החוצה" או "צרכים". עם הזמן הכלב מקשר בין המילה לפעולה.
            </li>
            <li>
              במקביל לשלב הראשון מומלץ לתחום אזור מסוים לכלב בתוך הבית או בחצר,
              אם אתם מגדלים את הכלב בדירה תוכלו להשתמש בכלוב בגודל המתאים לגופו
              של הכלב. גור קטן אפשר להחזיק בתוך קופסת קרטון.
            </li>
            <li>
              יש להגביל את שטח המחיה של הגור ולתחום את האזור, לפזר עיתונים או
              פדים לספיגת הצרכים, וכאשר מזהים שהכלב עומד לעשות את צרכיו עליכם
              להניח אותו על העיתון.
            </li>
            <li>
              כלבים לא אוהבים לשהות במקום בו הם עשו את הצרכים, כך הכלב לומד
              להתאפק עד היציאה לטיול, אך בימים הראשונים לאילוף הוא עלול לפספס,
              ואין להעניש אותו ולבטח שלא לדחוף את אפו לתוך הצרכים.
            </li>
            <li>
              חשוב להוציא את הכלב לטיול כל שעתיים שלוש, אך בלילה הגור יכול
              להתאפק לפחות 6 שעות.
            </li>
            <li>
              כאשר אתם מוציאים את גור הכלבים לטיול כדאי לעודד אותו לעשות את
              צרכיו, ומומלץ לקחת אותו למקום קבוע ולמנוע ממנו גירויים, למשל כלבים
              חדשים, העלולים להסיח את דעתו.
            </li>
            <li>
              לאחר מספר ימים, כאשר הגור לומד להתאפק ולשמור על אזור המחיה התחום
              שלו נקי במשך 5 ימים ברציפות, אפשר לתת לו להסתובב בשאר חלקי הבית
              באופן הדרגתי.
            </li>
          </ul>
        </p>
        <p>
          מומלץ לעקוב אחר התנהגות הכלב כדי להבין מתי הוא מסמן שברצונו לעשות
          צרכים. כך תוכלו למנוע פספוסים בבית, ולא תסבלו מריח לא נעים ומניקיון
          צואה ושתן. ככל שהגור מתבגר, כך הוא לומד לשלוט טוב יותר בצרכיו ולהתאפק
          עד הטיול. בגיל שנה, הכלב יכול להסתפק בשלושה טיולים ביום כדי לעשות את
          צרכיו בחוץ.
          <br />
          מרבית סוגי האוכל לכלבים יכילו גם דגנים. הדגנים מוספים למזון כדי להוזיל
          את עלות הייצור, ואין להם ערך תזונתי ממשי לכלב.
          <br /> יחד עם זאת, כלבים מסוגלים לפרק את החלבון והויטמינים המצויים
          בהם. כדאי לדעת כי קיימים כיום מחקרים שמראים{" "}
          <u>
            <b>כי מזון נטול דגנים עלול לגרום לבעיות לב.</b>
          </u>
        </p>
        <h4>אז איך בוחרים אוכל מתאים לכלב?</h4>
        <p>
          חשוב לבחור אוכל איכותי, אבל יותר מכך - לבחור מזון שבאמת מתאים לכלב
          שלכם. הפרמטר הראשון אליו יש לשים לב הוא גיל. מזון יבש לכלבים מתחלק לפי
          3 שכבות גיל: לגורים, לבוגרים ולמבוגרים. ההבדלים יהיו בגודל הכופתאות,
          וגם ברכיבים.
        </p>
        <h4>
          <u>
            <b>אם הכלב בריא באופן שגרתי</b>
          </u>
        </h4>
        <ul>
          <li>
            תבחרו אוכל איכותי, המכיל בשר או דג בכמות גבוהה, ויטמינים ותוספי
            תזונה.{" "}
          </li>
          <li>
            במחיר ממוצע - אתם לא חייבים לקחת את היקר ביותר, אבל אל תתפתו לקחת את
            המותג הכי זול בחנות.{" "}
          </li>
          <li>
            תבדקו איך הכלב מגיב לאוכל, ואם אתם רואים יציאות לא טובות, שהכלב לא
            אוכל או שהוא לא רגוע נסו אפשרויות אחרות.
          </li>
          <li>
            חלק מהחנויות מאפשרות להחזיר את השק ולקבל שק אחר, אם מגלים שהכלב לא
            מגיב טוב לאוכל. שווה לבדוק.
          </li>
        </ul>
        <h4>אם הכלב סובל מבעיות בריאותיות או אלרגיות</h4>
        <ul>
          <li>
            עברו על רשימת הרכיבים, וסננו שקי מזון המכילים רכיבים אליהם הכלב
            רגיש.
          </li>
          <li>תתייעצו עם וטרינר כדי להתאים לכלב אוכל מושלם עבורו.</li>
          <li>קנו קודם שק אוכל קטן יותר, כדי לבדוק כיצד הכלב מגיב לאוכל.</li>
        </ul>
        <h4>
          <b>
            <u>איפה קונים אוכל איכותי לכלב?</u>
          </b>
        </h4>
        <p>
          אפשר ללכת לחנות החיות הקרובה לביתכם ולרכוש אוכל לכלב, אבל בינינו, היום
          עושים דברים כאלה באינטרנט. תוכלו להזמין ישירות באתר החנות, או להתקשר,
          להתייעץ עם המוכר ולבחור באוכל הטוב ביותר לחבר הכי טוב שלכם.
        </p>
      </div>
    </>
  );
};

export default OutSideTheHome;
