import React from "react";
import { useNavigate } from "react-router-dom";

const SelectingMyDog = () => {
  const navigate = useNavigate();
  return (
    <>
      <div className="text-center">
        <img
          style={{ width: "100%" }}
          src="https://img.freepik.com/free-photo/adorable-little-dog-outdoors_23-2148740417.jpg?t=st=1655156470~exp=1655157070~hmac=872e3494a63e34986cdbddde532a2da1765d65a1b4e98a350cd68392baeb5a23&w=1380"
          alt="תמונה למאמר"
        />
      </div>
      <div className="container d-flex  flex-column justify-content-center">
        <div className="row text-center ">
          <button className="borderStyle col-2" onClick={() => navigate(-1)}>
            אחורה
          </button>
        </div>
        <h2 className="text-center mt-3">
          <b>כיצד אבחר את הכלב שמתאים לי?</b>
        </h2>
        <p>
          בשעה טובה החלטת לאמץ כלב ולהכניס חיית מחמד פרוותית ורגישה לחייך.
          <br /> כעת עליך לבחור כלב שיתאים לך, הן מבחינת גודל וצורת החיה, לרבות
          אורך הפרווה, והן מבחינת אופי, התנהגות ואישיות.
          <br /> כלבים מגיעים במגוון רחב של גדלים וגזעים, יש כלבים הזקוקים למרחב
          מחיה גדול ולפעילות גופנית מרובה, כלבים אחרים יכולים להסתפק גם בדירה
          קטנה.
          <br />
          למעשה, התשובה לשאלה כיצד לבחור כלב אינה פשוטה. לכל אדם יש העדפות
          שונות, לכן הדרך הנכונה והבטוחה לבחור כלב שיתאים לך היא להגיע לכלביות
          של העמותות כדי לקבל ייעוץ במקום ולבחור גור או כלב בוגר.
          <br /> הצוות המנוסה בעמותות השונות להצלת כלבים יכול לסייע לך עם מידע
          על הכלבים הנמצאים במכלאות, להבין את צרכיך הייחודיים ולהמליץ לך על כלב
          מתאים לאחר סדרת שאלות כמו האם אתה גר בבית פרטי עם חצר או בדירה קטנה
          בעיר, האם יש לך ילדים, האם הכלב ישהה רוב שעות היום לבד ועוד.
        </p>
        <h4>
          <b> גור או כלב בוגר, מעורב או גזעי?</b>
        </h4>

        <p>
          רגע לפני שאתה בוחר כלב זה או אחר עליך לקבל החלטה חשובה – האם לאמץ גור
          כלבים או לבחור כלב בוגר, והחלטה חשובה נוספת היא כלב גזעי או מעורב.
          <br />
          עליך לזכור כי ישראלים רבים אימצו כלבים שאינם מתאימים להם, ולא מעט
          אנשים אימצו כלב בלי להבין את גודל האחריות והמחויבות.
          <br />
        </p>
        <p>
          לכן, הכלל שחייב להנחות אותך בעת בחירת כלב הוא להשקיע זמן ומחשבה לפני
          האימוץ או רכישת כלב. <br />
          עליך להיות בטוח כי אתה מסוגל להעניק לכלב טיפול מסור הכולל לפחות 3
          טיולים ממושכים ביום, ביקורים סדירים אצל הווטרינר, אילוף, חיבוקים
          וליטופים ועוד. <br />
          עליך להתייחס גם לעלויות הגידול של הכלב, זו הוצאה העשויה להיות
          משמעותית, לכן חשוב להיערך נכון לקראת המהלך לבחירת הכלב וכדאי להתייעץ
          עם אנשי המקצוע או עם מגדלי כלבים מנוסים כדי להבין את המשמעות הרחבה של
          אימוץ וגידול כלב.
          <br />
          בדרך כלל כולם רוצים לאמץ גור קטן ופרוותי, אך לעיתים עדיף לבחור כלב
          בוגר ומחונך.
          <br /> הכלביות של העמותות וארגוני צער בעלי חיים מלאות עד אפס מקום
          בכלבים העומדים לאימוץ. זו הזדמנות בשבילך להציל חיים של כלב, לכן אם אתה
          שוקל לבחור כלב גזעי ולשלם תמורתו סכום גבוה, כדאי לבחון היטב את הבחירה
          מחדש וברוב המקרים עדיף לך לבחור כלב מעורב. <br />
          אם תבחר לקנות כלב גזעי תוכל לדעת פחות או יותר כיצד הכלב ייראה, מה יהיה
          גודלו ואלו תכונות אופיו יהיו לו.
          <br />
          אם תבחר לאמץ גור כלבים עליך להבין את המשמעות למעשה, כיוון שגור מחייב
          טיפול צמוד בשבועות הראשונים, יש לחנך אותו לעשות את צרכיו מחוץ לבית,
          ללמוד להתאפק ולא לעשות נזקים לרכוש. <br />
          כלב בוגר לרוב יהיה כבר מחונך, הוא נוח וקל יותר לטיפול, אך יש לו כבר
          אישיות מעוצבת.
        </p>
        <h4>
          <b>זכר או נקבה?</b>
        </h4>

        <p>
          כשאתה מאמץ כלב עליך לבחור בין זכר לנקבה. <br />
          כיום, כאשר אתה מאמץ כלב או כלבה מעמותה או ארגון עליך לשלם סל אימוץ
          והכלב יעבור סירוס בעוד הכלבות עוברות עיקור.
          <br /> עליך לזכור כי כלבים רבים המאומצים מושלכים לרחוב לכן הוחלט על
          מבצעי הסירוס והעיקור.
          <br />
          כלב זכר, בהתאם לגזע ולאופי, עשוי להיות יותר תוקפני, אך תוכל לאלף אותו.
          כלבות ניחנות לרוב באופי רגוע וביתי יותר, הן נאמנות לבעלים ולאחר העיקור
          לא תסבול מתופעת הייחום והשלכותי
        </p>

        <h4>
          <u>
            <b>בית הגידול ותנאי המחיה</b>
          </u>
        </h4>

        <p>
          בחירה נכונה של כלב כוללת התייחסות לתנאי המחיה והגידול שאתה יכול לספק.
          יש הבדל בין מגורים בדירה קטנה בעיר לבין מגורים במושב או בבית פרטי עם
          חצר גדולה. <br />
          לכן, אם אתה גר בדירה קטנה יחסית ותמיד חלמת לגדל כלב דני ענק, עדיף
          בשבילך ובעיקר בשביל הכלב שתבחר כלב בגודל קטן עד בינוני..
          <br />
          כמו כן, עליך להתייחס לנושא הפרווה, רגישות הכלב לחום וקור, אפשרות לגדל
          את הכלב במלונה ואם יש לך ילדים עליך להתייחס גם לכך.
          <br />
          <br />
          אם תבחר כלב גדול וחזק שאוהב לרדוף אחרי חתולים הילדים יתקשו לקחת את
          הכלב לטיול והמשימה תיפול עליך.
          <br />
          בנוסף, כדי לבחור נכון את הכלב שיתאים לך עליך להתייחס לרמת האנרגיה של
          הכלב ולאורח חייך. אם אתה אוהב לצאת לטיולים ארוכים, לרוץ בחוף הים
          ולעסוק בפעילות ספורטיבית, כלב אנרגטי יתאים לך, אחרת כדאי לך לבחור כלב
          שפחות זקוק לפעילות גופנית מאומצת כדי לפרוק אנרגיה. הפרט האחרון שמשפיע
          על בחירה הכלב הוא עלויות הגידול והטיפול.
          <br /> ככל שהכלב גדול ואנרגטי יותר כך תיאלץ לשלם יותר כסף לאוכל
          ולחיסונים. מעבר להוצאות האוכל יש עלויות נוספות שעליך להתייחס אליהן כמו
          צעצועים, אילוף, בדיקות ועוד.
          <br />
          <br />
          <b>לסיכום, </b><br />
          ההחלטה לאמץ כלב היא מבורכת וחשובה, לכן עליך לבחור כלב שיתאים לסגנון
          חייך ולתנאי הגידול שאתה יכול לספק עבורו. <br />חשוב להשקיע מחשבה וזמן בבחירת
          הכלב כדי לקבל החלטה נכונה, זו החלטה העומדת להשפיע על חייך לשנים רבות
          ואתה עומד ליהנות מחבר טוב לחיים ומכלב שיעניק לך ולבני משפחתך הרבה רגעי
          קסם ושמחה.
        </p>
      </div>
    </>
  );
};

export default SelectingMyDog;
